phpp01/prvn/objects_apg/dt-payroll-svc-feature-intg-postgres-run-trunc-limit/test/overwatch-test/src/test/java/com/intuit/psp/karate/tests/ptcadapter/request_qal.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.ptc.adapters.psp.payroll.sbd.intuit.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:getPSIDForEIN>
            <!--Optional:-->
            <sourceSystemCode>QBDT</sourceSystemCode>
            <!--Optional:-->
            <EIN>310520222</EIN>
        </web:getPSIDForEIN>
    </soapenv:Body>
</soapenv:Envelope>